# KNN

# 1.Load the dataset (titanic).

In [1]:
import pandas as pd

In [46]:
df = pd.read_csv("titanic.csv")

In [47]:
df.head()

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500

# 2.Split dataset into test and train (20:80).

In [30]:
X = df.iloc[:,0:1]
y = df.iloc[0:,1:2]

In [31]:
X

     PassengerId
0            892
1            893
2            894
3            895
4            896
..           ...
413         1305
414         1306
415         1307
416         1308
417         1309

[418 rows x 1 columns]

In [32]:
y

     Survived
0           0
1           1
2           0
3           0
4           1
..        ...
413         0
414         1
415         0
416         0
417         0

[418 rows x 1 columns]

In [33]:
from sklearn.model_selection import train_test_split

In [34]:
X_train, X_test, y_train, y_test = train_test_split(X,y, test_size = 0.2, random_state = 4)

# 3.Build  KNN  classifier  with  k  value  as  2  for  identifying  the Passenger Survived.

In [35]:
from sklearn.neighbors import KNeighborsClassifier

In [36]:
knn2 = KNeighborsClassifier(n_neighbors = 2)

In [37]:
X_train

     PassengerId
316         1208
123         1015
83           975
209         1101
245         1137
..           ...
360         1252
385         1277
197         1089
174         1066
122         1014

[334 rows x 1 columns]

In [38]:
y_train

     Survived
316         0
123         0
83          0
209         0
245         0
..        ...
360         0
385         1
197         1
174         0
122         1

[334 rows x 1 columns]

In [39]:
knn2.fit(X_train, y_train)

C:\ProgramData\Anaconda3\lib\site-packages\sklearn\neighbors\_classification.py:198: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  return self._fit(X, y)

KNeighborsClassifier(n_neighbors=2)

# 4.Build KNN classifier with k value as 4 for identifying the the Passenger Survived.

In [40]:
knn4 = KNeighborsClassifier(n_neighbors = 4)

In [41]:
knn4.fit(X_train, y_train)

C:\ProgramData\Anaconda3\lib\site-packages\sklearn\neighbors\_classification.py:198: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  return self._fit(X, y)

KNeighborsClassifier(n_neighbors=4)

# 5.Evaluate the step-3 and step-4.

In [42]:
knn2.score(X_test,y_test)

C:\ProgramData\Anaconda3\lib\site-packages\sklearn\neighbors\_classification.py:228: FutureWarning: Unlike other reduction functions (e.g. `skew`, `kurtosis`), the default behavior of `mode` typically preserves the axis it acts along. In SciPy 1.11.0, this behavior will change: the default value of `keepdims` will become False, the `axis` over which the statistic is taken will be eliminated, and the value None will no longer be accepted. Set `keepdims` to True or False to avoid this warning.
  mode, _ = stats.mode(_y[neigh_ind, k], axis=1)

0.5238095238095238

In [45]:
knn4.score(X_test,y_test)

C:\ProgramData\Anaconda3\lib\site-packages\sklearn\neighbors\_classification.py:228: FutureWarning: Unlike other reduction functions (e.g. `skew`, `kurtosis`), the default behavior of `mode` typically preserves the axis it acts along. In SciPy 1.11.0, this behavior will change: the default value of `keepdims` will become False, the `axis` over which the statistic is taken will be eliminated, and the value None will no longer be accepted. Set `keepdims` to True or False to avoid this warning.
  mode, _ = stats.mode(_y[neigh_ind, k], axis=1)

0.5595238095238095